{
  "transcripts": [
    {
      "id": "1",
      "content": "AI Hello, this is a sample interview transcript. This is anonymized example data for demonstration purposes. The content has been replaced with generic placeholder text to show the expected structure. In a real transcript, this would contain the actual interview dialogue between an AI interviewer and a student about their educational experiences. User Thank you for the explanation. AI What is your field of study? User I am studying Computer Science and I'm in my second semester. AI Thank you for sharing. Have you attended any courses from our institute? User Yes, I have taken Introduction to Programming and Data Structures. AI What was the best lecture in your program so far and why? User I really enjoyed the Programming course because it had practical examples and hands-on coding exercises. The professor explained complex concepts in simple terms. AI What has bothered you about your lectures? User Sometimes the pace is too fast and there isn't enough time for questions. AI What is particularly important to you in lectures? User I value practical applications and real-world examples. Theory is important but I learn better when I can see how concepts apply to actual problems. AI Do you prefer courses with 5 or 10 credit points? User I don't have a strong preference, but I think 10 credit point courses allow for more in-depth coverage of topics. AI What lecture format do you prefer? User I prefer a combination of lectures and practical sessions. Pure theory is harder to follow. AI What helps you most with learning? User Interactive elements like group discussions, coding exercises, and case studies work best for me. Videos and online materials are also helpful for review. AI What do you think about project modules where you work in teams? User I think they're valuable because they simulate real work environments and help develop collaboration skills. AI On a scale of 1 to 5, how much do you like group work? User I'd say 4. I enjoy collaborating with others and learning from different perspectives. AI What type of exam do you prefer? User I prefer project-based assessments over traditional exams because they better reflect real-world skills. AI How do you feel about active participation being part of grading? User I think it's fair as long as the criteria are clear and it encourages engagement. AI How do you find the registration process? User It's generally straightforward once you understand the system. AI Do you feel prepared for your professional future? User Yes, I think the practical focus of the courses helps prepare us well. AI Is there anything else you'd like to share? User I appreciate the opportunity to provide feedback. The institute does a good job overall.",
      "language": "English",
      "course": "Computer Science",
      "semester": "2",
      "gender": "prefer-not-to-say"
    },
    {
      "id": "2",
      "content": "AI Hallo, dies ist ein Beispiel-Interview-Transkript. Dies sind anonymisierte Beispieldaten für Demonstrationszwecke. Der Inhalt wurde durch generischen Platzhaltertext ersetzt, um die erwartete Struktur zu zeigen. In einem echten Transkript würde dies den tatsächlichen Interview-Dialog zwischen einem KI-Interviewer und einem Studenten über ihre Bildungserfahrungen enthalten. User Vielen Dank für die Erklärung. AI Was studieren Sie und in welchem Semester sind Sie? User Ich studiere Wirtschaftsingenieurwesen im dritten Semester. AI Haben Sie bereits Veranstaltungen unseres Instituts besucht? User Ja, ich habe Innovationsmanagement und Strategisches Management besucht. AI Was war die beste Vorlesung in Ihrem Studium bisher und warum? User Die Innovationsmanagement-Vorlesung war sehr gut, weil sie viele Praxisbeispiele hatte und interaktive Elemente. AI Was hat Sie an Ihren Vorlesungen gestört? User Manchmal waren die Vorlesungen zu theoretisch ohne genug praktische Anwendung. AI Was ist Ihnen bei Vorlesungen besonders wichtig? User Mir ist wichtig, dass die Inhalte praxisnah sind und ich das Gelernte später anwenden kann. AI Bevorzugen Sie Veranstaltungen mit 5 oder 10 Credit Points? User Ich finde 10 Credit Points gut, weil man sich intensiver mit dem Thema beschäftigen kann. AI Welches Vorlesungsformat gefällt Ihnen am besten? User Eine Mischung aus Vorlesung und praktischen Übungen funktioniert für mich am besten. AI Was hilft Ihnen am meisten beim Lernen? User Fallstudien, Gruppenarbeiten und praktische Projekte helfen mir sehr beim Verstehen der Konzepte. AI Was halten Sie von Projektmodulen mit Teamarbeit? User Ich finde sie sehr wertvoll, weil man dabei Soft Skills entwickelt und verschiedene Perspektiven kennenlernt. AI Wie gerne mögen Sie Gruppenarbeit auf einer Skala von 1 bis 5? User Ich würde sagen 3 bis 4, je nach Gruppe und Aufgabenstellung. AI Welche Prüfungsform bevorzugen Sie? User Ich bevorzuge Hausarbeiten und Präsentationen gegenüber klassischen Klausuren. AI Wie finden Sie es, wenn aktive Mitarbeit bewertet wird? User Das finde ich gut, solange die Bewertungskriterien transparent sind. AI Wie finden Sie den Anmeldeprozess? User Er ist etwas kompliziert am Anfang, aber man gewöhnt sich daran. AI Fühlen Sie sich gut auf Ihre berufliche Zukunft vorbereitet? User Ja, besonders durch die praxisorientierten Kurse und Projektarbeiten. AI Möchten Sie noch etwas hinzufügen? User Vielen Dank für die Möglichkeit, Feedback zu geben.",
      "language": "German",
      "course": "Wirtschaftsingenieurwesen", 
      "semester": "3",
      "gender": "prefer-not-to-say"
    },
    {
      "id": "3",
      "content": "AI This is another example interview transcript with anonymized content for demonstration purposes. User Thank you for conducting this survey. AI What are you studying and which semester are you in? User I'm studying Business Administration in my fourth semester. AI Have you attended courses from our institute? User Yes, I took Strategic Management and Technology Innovation courses. AI What was the best lecture in your master's program? User The Strategic Management course was excellent because of the case study approach and guest speakers from industry. AI What bothered you about your lectures? User Some lectures were too theoretical without enough practical application opportunities. AI What is particularly important to you in lectures? User I value interactive learning, real-world examples, and opportunities to apply theoretical knowledge. AI Do you prefer 5 or 10 credit point courses? User I prefer 10 credit point courses because they allow for deeper exploration of topics. AI Which lecture format do you like best? User I prefer blended learning with both in-person sessions and online components. AI What helps you most with learning? User Case studies, group projects, and interactive discussions are most effective for my learning style. AI What do you think about project modules with teamwork? User They are essential for developing collaboration skills and preparing for professional environments. AI How much do you like group work on a scale of 1-5? User I'd rate it a 4. I enjoy collaborating and learning from diverse perspectives. AI What type of examination do you prefer? User I prefer portfolio-based assessments that include multiple components rather than single exams. AI How do you feel about active participation in grading? User I support it as it encourages engagement and rewards consistent effort throughout the course. AI How do you find the registration process? User It's manageable once you understand the system, though it could be more intuitive. AI Do you feel well prepared for your professional future? User Yes, particularly through the practical projects and industry connections in the courses. AI Anything else you'd like to share? User I appreciate the focus on both theoretical foundations and practical skills development.",
      "language": "English",
      "course": "Business Administration",
      "semester": "4", 
      "gender": "prefer-not-to-say"
    },
    {
      "id": "4",
      "content": "AI This is a fourth example transcript with placeholder content for demonstration. User I'm ready to participate in this survey. AI What is your field of study and current semester? User I'm studying Industrial Engineering in my second semester of the master's program. AI Have you taken any courses from our institute? User Yes, I completed Innovation Management and Product Development courses. AI Which was the best lecture in your studies so far? User The Product Development course stood out because of its hands-on approach and real product case studies. AI What aspects of your lectures have been problematic? User Sometimes the workload distribution throughout the semester is uneven, with too much concentration at the end. AI What do you value most in educational experiences? User I appreciate when courses connect theory to practice and provide opportunities for creative problem-solving. AI Do you have a preference between 5 and 10 credit point courses? User I like 10 credit point courses because they allow for more comprehensive project work. AI What teaching format works best for you? User Workshop-style sessions with interactive elements and peer collaboration are most effective. AI What learning methods support you best? User Project-based learning, simulation exercises, and peer feedback sessions work well for me. AI How do you view project modules involving team collaboration? User They're crucial for developing professional skills and understanding different working styles. AI Rate your preference for group work from 1 to 5? User I'd give it a 5. I thrive in collaborative environments and enjoy diverse team dynamics. AI What examination format do you prefer? User I favor continuous assessment through projects and presentations over traditional written exams. AI What's your opinion on participation grades? User I think they're valuable when criteria are clear and fairly applied across all students. AI How do you experience the course registration system? User It works well once you learn the process, though better user guidance would help newcomers. AI Do you feel adequately prepared for your career? User Yes, especially through the practical projects and industry collaboration opportunities. AI Any final thoughts to share? User The institute does well in balancing academic rigor with practical application.",
      "language": "English",
      "course": "Industrial Engineering",
      "semester": "2",
      "gender": "prefer-not-to-say"
    }
  ],
  "metadata": {
    "lastUpdated": "2024-01-15",
    "totalEntries": 4,
    "version": "example-v1.0",
    "description": "Anonymized example transcript data for demonstration purposes. Replace with actual interview transcripts for real analysis."
  }
}